jeacelo/CC3200-IoT/main.c
/*Message Queue*/
OsiMsgQ_t g_PBQueue;

/* connection configuration */
connect_config usr_connect_config[] =
{
    {
        {
            {
                SL_MQTT_NETCONN_URL,
                SERVER_ADDRESS,
                PORT_NUMBER,
                0,
                0,
                0,
                NULL
            },
            SERVER_MODE,
            true,
        },
        NULL,
        (unsigned char *)"user1",
        NULL,
        NULL,
        true,
        KEEP_ALIVE_TIMER,
        {Mqtt_Recv, sl_MqttEvt, sl_MqttDisconnect},
        TOPIC_COUNT,
        {TOPIC_CONFIG}, /* Tantos como TOPIC_COUNT */
        {QOS2}, /* Tantos como topics */
        {WILL_TOPIC,WILL_MSG,WILL_QOS,WILL_RETAIN},
        false
    }
};

/* library configuration */
SlMqttClientLibCfg_t Mqtt_Client={
    1882,
    TASK_PRIORITY,
    30,
    true,
    (long(*)(const char *, ...))UART_PRINT
};

/*Publishing topics and messages*/
const char *pub_topic_sw2 = PUB_TOPIC_FOR_SW2;
const char *pub_topic_sw3 = PUB_TOPIC_FOR_SW3;
const char *pub_topic_json = PUB_TOPIC_JSON;
char *sub_topic_leds = "initializated";
char *sub_topic_sensors = "initializated2";
char *pub_topic_temp = "initializated3";
char *pub_topic_acc = "initializated4";
const unsigned char *data_sw2={"Push button sw2 is pressed on CC32XX device"};
const unsigned char *data_sw3={"Push button sw3 is pressed on CC32XX device"};

void *app_hndl = (void*)usr_connect_config;

static uint8_t pui8Colors[NUM_LEDS][3];
static uint8_t pui8SPIOut[NUM_LEDS][WS2812_SPI_BYTE_PER_CLR *
	                                  WS2812_SPI_BIT_WIDTH];

float temp = 0;
signed char accX = 0;
signed char accY = 0;
signed char accZ = 0;

int ref_temp, ref_acc;

OsiTaskHandle TemppTaskHandle = NULL, AccpTaskHandle = NULL;

//*****************************************************************************
//                 GLOBAL VARIABLES -- End
//*****************************************************************************

//****************************************************************************
//! Defines Mqtt_Pub_Message_Receive event handler.
//! Client App needs to register this event handler with sl_ExtLib_mqtt_Init 
//! API. Background receive task invokes this handler whenever MQTT Client 
//! receives a Publish Message from the broker.
//!
//!\param[out]     topstr => pointer to topic of the message
//!\param[out]     top_len => topic length
//!\param[out]     payload => pointer to payload
//!\param[out]     pay_len => payload length
//!\param[out]     retain => Tells whether its a Retained message or not
//!\param[out]     dup => Tells whether its a duplicate message or not
//!\param[out]     qos => Tells the Qos level
//!
//!\return none
//****************************************************************************
static void
Mqtt_Recv(void *app_hndl, const char  *topstr, long top_len, const void *payload,
                       long pay_len, bool dup,unsigned char qos, bool retain)
{
    int aux;
	bool booleano;
    char *output_str=(char*)pvPortMalloc(top_len+1);
    memset(output_str,'\0',top_len+1);
    strncpy(output_str, (char*)topstr, top_len);
    output_str[top_len]='\0';
    int red, green, blue;
    int index;
    long lRetVal = -1;

    if (strncmp(output_str,TOPIC_JSON, top_len) == 0)
	{
    	//JMCG: Ejemplo de parseo JSON....
    	if (json_scanf((const char *)payload, pay_len, "{ redLed: %B }", &booleano)>0)
    	{

    		if (booleano)
    			GPIO_IF_LedOn(MCU_RED_LED_GPIO);
    		else
    			GPIO_IF_LedOff(MCU_RED_LED_GPIO);

    	}
    	if (json_scanf((const char *)payload, pay_len, "{ greenLed: %B }", &booleano)>0)
    	{

    		if (booleano)
    			GPIO_IF_LedOn(MCU_GREEN_LED_GPIO);
    		else
    			GPIO_IF_LedOff(MCU_GREEN_LED_GPIO);

    	}
    	if (json_scanf((const char *)payload, pay_len, "{ orangeLed: %B }", &booleano)>0)
    	{

    		if (booleano)
    			GPIO_IF_LedOn(MCU_ORANGE_LED_GPIO);
    		else
    			GPIO_IF_LedOff(MCU_ORANGE_LED_GPIO);

    	}
	}
    else if(strncmp(output_str,sub_topic_leds, top_len) == 0)
    {
    	if (json_scanf((const char *)payload, pay_len, "{ LED:%d R:%d G:%d B:%d }", &index, &red, &green, &blue)>0)
    	{
    		waitSPITramsfer();
    		osi_Sleep(100);
    		pui8Colors[index][0]=green;
    		pui8Colors[index][1]=red;
    		pui8Colors[index][2]=blue;
    		WSGRBtoSPI(pui8SPIOut[index], pui8Colors[index][0],
    				pui8Colors[index][1], pui8Colors[index][2]);
    		InitSPITransfer((uint8_t*)pui8SPIOut, sizeof(pui8SPIOut));
    	}
    }
    else if(strncmp(output_str,sub_topic_sensors, top_len) == 0)
    {
        if (json_scanf((const char *)payload, pay_len, "{ TEMP: %d }", &aux)>0)
        {
            if (aux>0)
            {
                ref_temp = aux;
                if (TemppTaskHandle == NULL)
                {
                    lRetVal = osi_TaskCreate(TempTask,
                            (const signed char *)"TempTask",
                            OSI_STACK_SIZE, &ref_temp, 2, &TemppTaskHandle );

                    if(lRetVal < 0)
                    {
                        ERR_PRINT(lRetVal);
                        LOOP_FOREVER();
                    }
                }
            }
            else if (aux==0)
            {
                if (TemppTaskHandle != NULL)
                {
                    osi_TaskDelete(&TemppTaskHandle);
                    TemppTaskHandle = NULL;
                }
            }
        }
        if (json_scanf((const char *)payload, pay_len, "{ ACC: %d }", &aux)>0)
        {
            if (aux>0)
            {
                ref_acc = aux;
                if (AccpTaskHandle == NULL)
                {
                    lRetVal = osi_TaskCreate(AccTask,
                            (const signed char *)"AccTask",
                            OSI_STACK_SIZE, &ref_acc, 2, &AccpTaskHandle);

                    if(lRetVal < 0)
                    {
                        ERR_PRINT(lRetVal);
                        LOOP_FOREVER();
                    }
                }
            }
            else if (aux==0)
            {
                if (AccpTaskHandle != NULL)
                {
                    osi_TaskDelete(&AccpTaskHandle);
                    AccpTaskHandle = NULL;
                }
            }
        }
    }
    else if (strncmp(output_str,TOPIC_CONFIG, top_len) == 0)
    {
        UART_PRINT("%s",sub_topic_leds);
        if (json_scanf((const char *)payload, pay_len, "{ LEDS: %Q }", &sub_topic_leds)>0)
        {
            UART_PRINT("\n\rTopic Leds Received: ");
            UART_PRINT("%s\n",sub_topic_leds);
        }
        UART_PRINT("%s",sub_topic_sensors);
        if (json_scanf((const char *)payload, pay_len, "{ SENSORS: %Q }", &sub_topic_sensors)>0)
        {
            UART_PRINT("\n\rTopic Sensors Received: ");
            UART_PRINT("%s\n",sub_topic_sensors);
        }
        UART_PRINT("%s",pub_topic_temp);
        if (json_scanf((const char *)payload, pay_len, "{ TEMP: %Q }", &pub_topic_temp)>0)
        {
            UART_PRINT("\n\rTopic Temp Received: ");
            UART_PRINT("%s\n",pub_topic_temp);
        }
        UART_PRINT("%s",pub_topic_acc);
        if (json_scanf((const char *)payload, pay_len, "{ ACC: %Q }", &pub_topic_acc)>0)
        {
            UART_PRINT("\n\rTopic Acc Received: ");
            UART_PRINT("%s\n",pub_topic_acc);
        }
    }

