jeacelo/CC3200-IoT/main.c
        	json_printf(&out1,"{ Temperature : %f }",roundf(temp));


        	sl_ExtLib_MqttClientSend((void*)local_con_conf[iCount].clt_ctx,
        			pub_topic_temp,json_buffer,strlen((char*)json_buffer),QOS2,RETAIN);


        	UART_PRINT("\n\r CC3200 Publishes the following message \n\r");
        	UART_PRINT("Topic: %s\n\r",pub_topic_temp);
        }
        else if(READ_ACC == RecvQue)
        {
        	BMA222ReadNew(&accX, &accY, &accZ);
        	struct json_out out1 = JSON_OUT_BUF(json_buffer, sizeof(json_buffer));

        	//Reinicio out1, de lo contrario se van acumulando los printfs

        	json_printf(&out1,"{ AccX : %d, AccY: %d, AccZ : %d }", (int)accX, (int)accY, (int)accZ);


        	sl_ExtLib_MqttClientSend((void*)local_con_conf[iCount].clt_ctx,
        			pub_topic_acc,json_buffer,strlen((char*)json_buffer),QOS2,RETAIN);


        	UART_PRINT("\n\r CC3200 Publishes the following message \n\r");
        	UART_PRINT("Topic: %s\n\r",pub_topic_acc);
        }
        else if(BROKER_DISCONNECTION == RecvQue)
        {
            iConnBroker--;
            if(iConnBroker < 1)
            {
                //
                // device not connected to any broker
                //
                goto end;
            }
        }
    }
end:
    //
    // Deinitializating the client library
    //
    sl_ExtLib_MqttClientExit();
    UART_PRINT("\n\r Exiting the Application\n\r");
    
    LOOP_FOREVER();


#else


    //Antes de salir, crea la tarea que genera el patron
    // Podría hacerlo en otro sitio, por ejemplo un comando.
	//lRetVal = osi_TaskCreate(ColorLedTask,
	//                        (const signed char *)"ColorLeds",
	//                        OSI_STACK_SIZE, NULL, 2, NULL );

	if(lRetVal < 0)
	{
	   	ERR_PRINT(lRetVal);
	   	LOOP_FOREVER();
	}




    //Cambiar....> Ahora la parque que se intenta conectar, se harÃ­a en el interprete de comandos...
    //Se tendria que lanzar una tarea adicional
    OsiTaskHandle handle=NULL;
    osi_TaskDelete(&handle);

#endif
}


void TempTask(void *pvParameters)
{
	int refresh;
	while(1){
		refresh = *((int *)pvParameters);
		osi_messages var = READ_TEMP;
		//
		// write message indicating exit from sending loop
		//
		osi_MsgQWrite(&g_PBQueue,&var,OSI_NO_WAIT);
		osi_Sleep(refresh);
	}
}

void AccTask(void *pvParameters)
{
	int refresh;
	while(1){
		refresh = *((int *)pvParameters);
		osi_messages var = READ_ACC;
		//
		// write message indicating exit from sending loop
		//
		osi_MsgQWrite(&g_PBQueue,&var,OSI_NO_WAIT);
		osi_Sleep(refresh);
	}
}


//}

//*****************************************************************************
//
//! Main 
//!
//! \param  none
//!
//! This function
//!    1. Invokes the SLHost task
//!    2. Invokes the ConnectWiFI
//!
//! \return None
//!
//*****************************************************************************



void main()
{ 
    long lRetVal = -1;

    //
    // Initialize the board configurations
    //
    BoardInit();

    //
    // Pinmux for UART
    //
    PinMuxConfig();

    //
    // Configuring UART
    //
    InitTerm();

    InitRGBSPI();
    WSArrayInit(pui8SPIOut, sizeof(pui8SPIOut));
    InitSPITransfer((uint8_t*)pui8SPIOut, sizeof(pui8SPIOut));

    //
	// Start the SimpleLink Host
    //
    lRetVal = VStartSimpleLinkSpawnTask(SPAWN_TASK_PRIORITY);
    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
        LOOP_FOREVER();
    }

    //
    // Start the MQTT Client task
    //
    osi_MsgQCreate(&g_PBQueue,"PBQueue",sizeof(osi_messages),10);
    lRetVal = osi_TaskCreate(ConnectWiFI,
                            (const signed char *)"WifiApp",
                            OSI_STACK_SIZE, NULL, 2, NULL );

    if(lRetVal < 0)
    {
    	ERR_PRINT(lRetVal);
    	LOOP_FOREVER();
    }

    /*lRetVal = osi_TaskCreate(TempTask,
    		(const signed char *)"TempTask",
			OSI_STACK_SIZE, NULL, 2, NULL );

    if(lRetVal < 0)
    {
    	ERR_PRINT(lRetVal);
    	LOOP_FOREVER();
    }*/

    //
    // Start the task scheduler
    //
    osi_start();
}

